garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1768.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA1PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA1PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x510">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:desc="" edc:mask="0xf" edc:name="OPA1PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nnn" edc:cname="OPA1CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-000" edc:name="OPA1CON" edc:nzwidth="8" edc:por="0--0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x511">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1ORM" edc:desc="" edc:mask="0x3" edc:name="OPA1ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA1ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA1ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:desc="" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA1ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA1ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA1ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA1ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x512">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA2NCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA2NCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x513">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2NCH" edc:desc="" edc:mask="0xf" edc:name="OPA2NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA2PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA2PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x514">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2PCH" edc:desc="" edc:mask="0xf" edc:name="OPA2PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nnn" edc:cname="OPA2CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-000" edc:name="OPA2CON" edc:nzwidth="8" edc:por="0--0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x515">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2ORM" edc:desc="" edc:mask="0x3" edc:name="OPA2ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA2ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA2ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2UG" edc:desc="" edc:mask="0x1" edc:name="OPA2UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2EN" edc:desc="" edc:mask="0x1" edc:name="OPA2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA2ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA2ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA2ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA2ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x516">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0x58C"/>
        <edc:SFRDef edc:access="------nn" edc:cname="DACLD" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="DACLD" edc:nzwidth="8" edc:por="------00" edc:_addr="0x590">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1LD" edc:desc="" edc:mask="0x1" edc:name="DAC1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2LD" edc:desc="" edc:mask="0x1" edc:name="DAC2LD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="DAC1CON0" edc:desc="" edc:impl="0xed" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="DAC1CON0" edc:nzwidth="8" edc:por="000-00-0" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x591">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:desc="" edc:mask="0x1" edc:name="FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACFM" edc:desc="" edc:mask="0x1" edc:name="DACFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC1NSS" edc:desc="" edc:mask="0x1" edc:name="DAC1NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS" edc:desc="" edc:mask="0x3" edc:name="DAC1PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE1" edc:desc="" edc:mask="0x1" edc:name="DAC1OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1FM" edc:desc="" edc:mask="0x1" edc:name="DAC1FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1EN" edc:desc="" edc:mask="0x1" edc:name="DAC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC1NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC1NSS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC1REF" edc:desc="" edc:name="DAC1REF" edc:nzwidth="0x10" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x592">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1REFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1REFL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x592">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC1CON1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC1REF0" edc:desc="" edc:mask="0x1" edc:name="DAC1REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF1" edc:desc="" edc:mask="0x1" edc:name="DAC1REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF2" edc:desc="" edc:mask="0x1" edc:name="DAC1REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF3" edc:desc="" edc:mask="0x1" edc:name="DAC1REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF4" edc:desc="" edc:mask="0x1" edc:name="DAC1REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF5" edc:desc="" edc:mask="0x1" edc:name="DAC1REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF6" edc:desc="" edc:mask="0x1" edc:name="DAC1REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF7" edc:desc="" edc:mask="0x1" edc:name="DAC1REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R5" edc:desc="" edc:mask="0x1" edc:name="R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R6" edc:desc="" edc:mask="0x1" edc:name="R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R7" edc:desc="" edc:mask="0x1" edc:name="R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC1R0" edc:desc="" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R1" edc:desc="" edc:mask="0x1" edc:name="DAC1R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R2" edc:desc="" edc:mask="0x1" edc:name="DAC1R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R3" edc:desc="" edc:mask="0x1" edc:name="DAC1R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R4" edc:desc="" edc:mask="0x1" edc:name="DAC1R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R5" edc:desc="" edc:mask="0x1" edc:name="DAC1R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R6" edc:desc="" edc:mask="0x1" edc:name="DAC1R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R7" edc:desc="" edc:mask="0x1" edc:name="DAC1R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF6" edc:desc="" edc:mask="0x1" edc:name="REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF7" edc:desc="" edc:mask="0x1" edc:name="REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
