garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1768.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS0" edc:desc="" edc:mask="0x1" edc:name="G1RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS1" edc:desc="" edc:mask="0x1" edc:name="G1RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS2" edc:desc="" edc:mask="0x1" edc:name="G1RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS3" edc:desc="" edc:mask="0x1" edc:name="G1RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS4" edc:desc="" edc:mask="0x1" edc:name="G1RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS5" edc:desc="" edc:mask="0x1" edc:name="G1RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS6" edc:desc="" edc:mask="0x1" edc:name="G1RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS7" edc:desc="" edc:mask="0x1" edc:name="G1RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS8" edc:desc="" edc:mask="0x1" edc:name="RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS10" edc:desc="" edc:mask="0x1" edc:name="RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS8" edc:desc="" edc:mask="0x1" edc:name="G1RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS9" edc:desc="" edc:mask="0x1" edc:name="G1RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS10" edc:desc="" edc:mask="0x1" edc:name="G1RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS11" edc:desc="" edc:mask="0x1" edc:name="G1RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS12" edc:desc="" edc:mask="0x1" edc:name="G1RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS13" edc:desc="" edc:mask="0x1" edc:name="G1RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS14" edc:desc="" edc:mask="0x1" edc:name="G1RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS15" edc:desc="" edc:mask="0x1" edc:name="G1RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x697">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM0" edc:desc="" edc:mask="0x1" edc:name="G1RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM1" edc:desc="" edc:mask="0x1" edc:name="G1RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM2" edc:desc="" edc:mask="0x1" edc:name="G1RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM3" edc:desc="" edc:mask="0x1" edc:name="G1RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM4" edc:desc="" edc:mask="0x1" edc:name="G1RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM5" edc:desc="" edc:mask="0x1" edc:name="G1RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM6" edc:desc="" edc:mask="0x1" edc:name="G1RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM7" edc:desc="" edc:mask="0x1" edc:name="G1RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x698">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM8" edc:desc="" edc:mask="0x1" edc:name="RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM10" edc:desc="" edc:mask="0x1" edc:name="RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM8" edc:desc="" edc:mask="0x1" edc:name="G1RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM9" edc:desc="" edc:mask="0x1" edc:name="G1RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM10" edc:desc="" edc:mask="0x1" edc:name="G1RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM11" edc:desc="" edc:mask="0x1" edc:name="G1RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM12" edc:desc="" edc:mask="0x1" edc:name="G1RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM13" edc:desc="" edc:mask="0x1" edc:name="G1RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM14" edc:desc="" edc:mask="0x1" edc:name="G1RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM15" edc:desc="" edc:mask="0x1" edc:name="G1RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
