garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1768.PIC
        <edc:SFRDef edc:access="nn-----n" edc:cname="PWM5LDCON" edc:desc="" edc:impl="0xc1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0" edc:name="PWM5LDCON" edc:nzwidth="8" edc:por="00-----0" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x1" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM5LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM5LDS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM5LDS" edc:desc="" edc:mask="0x1" edc:name="PWM5LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM5LDM" edc:desc="" edc:mask="0x1" edc:name="PWM5LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5LD" edc:desc="" edc:mask="0x1" edc:name="PWM5LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn---n" edc:cname="PWM5OFCON" edc:desc="" edc:impl="0x71" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000---0" edc:name="PWM5OFCON" edc:nzwidth="8" edc:por="-000---0" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x1" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM5OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM5OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM5OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM5OFS" edc:desc="" edc:mask="0x1" edc:name="PWM5OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM5OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM5OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OFM" edc:desc="" edc:mask="0x3" edc:name="PWM5OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM6PH" edc:desc="" edc:name="PWM6PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM6PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6PHL" edc:desc="" edc:mask="0xff" edc:name="PWM6PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM6PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6PHH" edc:desc="" edc:mask="0xff" edc:name="PWM6PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM6DC" edc:desc="" edc:name="PWM6DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM6DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6DCL" edc:desc="" edc:mask="0xff" edc:name="PWM6DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM6DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6DCH" edc:desc="" edc:mask="0xff" edc:name="PWM6DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
